// ﻿// Напишите программу, которая принимает на вход одно число (А) и выдает сумму числе от 1 до А
// 7->28
// 4->10
// 8->36

System.Console.WriteLine("Введите значение: ");
int number = Math.Abs(Convert.ToInt32(Console.ReadLine())); //Matth Abs  - функция для абсолютных чисел, отриц.числа превращает в положительные

int sum = 0; // задаем переменную для цикла, сумму

for(int i = 1; i <= number; i++) //цикл начинается с 1, <= number, т.к. пеерменная number в цикл должна входить, показатель i++ будет увеличивать цикл на 1
sum += i; // sum = sum+i
    System.Console.WriteLine(sum);


